app/controllers/cameras_controller.rb

SELECT "cameras".* FROM "cameras"
---
  def index
    @cameras = Camera.all

INSERT INTO "cameras" ("first_name", "last_name", "morf", "startdate", "enddate", "category", "address", "landmark", "emil", "phone", "cameraman", "owner", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @camera = Camera.new(camera_params)

    respond_to do |format|
      if @camera.save

UPDATE "cameras" SET "cameraman" = ?, "owner" = ?, "updated_at" = ? WHERE "cameras"."id" = ?  [["cameraman", "pandu"], ["owner", "mallesh"], ["updated_at", "2019-06-15 12:40:35.329527"], ["id", 32]]
---
  def update
    respond_to do |format|
      if @camera.update(camera_params)

DELETE FROM "cameras" WHERE "cameras"."id" = ?  [["id", 16]]
---
  def destroy
    @camera.destroy

SELECT  "cameras".* FROM "cameras" WHERE "cameras"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
---
    def set_camera
      @camera = Camera.find(params[:id])